The solution is failing to do segments which are parallel and should intersect.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FailToIntersectParallelSegmentsWarning { get; }
  Visual Basic
Public Shared ReadOnly Property FailToIntersectParallelSegmentsWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FailToIntersectParallelSegmentsWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace